---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamYoungModn2
source: html/3e0974c7-144d-b83c-0a6f-504622e2adf8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamYoungModn2 Property

"Young's Modulus 2"

## Syntax (C#)
```csharp
public static ForgeTypeId PhyMaterialParamYoungModn2 { get; }
```